// 函数自执行

(() => console.log('第1个函数自执行'))()

;(() => console.log('第2个函数自执行'))()

/*
就在飞剑快要命中阿坤面门的时候，一道白衣身影，挡在了阿坤面前。
只见他右手持剑，向前一刺。
两剑交锋瞬间便僵持在了一起。
A教长老看到自己的攻势被阻挡，且看清来人胸口处印着的金色S后，便迅速收剑，翻身后退。
A教长老站稳身形后，向着白衣男子道：”
  啧啧啧，原来是S教的执法长老，你我两派同出一脉。你为何要保这魔修。
  你可知，他在我宗入宗考试时，居然使用双引号，而不是单引号。甚至不写分号。
“
S教长老道：“
  此子，虽然使用了双引号，但他绝对不是魔修，他只是一介散修。
  在修炼时因没人指点，误入歧途罢了。
  两年半前，我奉老祖之命，下山除魔，顺便寻找可造之才。
  在路过白村时，发现此子天赋异禀，竟能无师自通编程。
  虽然语法稍微有些不规范，但是程序能正常运行，已有资格加入到我S教。
  只需日后稍加引导，他便可规范编程。
  我曾引导他从8个空格的缩进，变成4个空格的缩进，又变成如今的2个空格的缩进。
  那么我相信，也能把他从双引号引导为单引号，再引导为反引号。
  A教的门规就是因为太过严苛，才导致如今门徒的招收如今艰难。
  他天生不喜写分号的行为，更是深得我心。
”
A教长老道：“
  哼，荒谬，不严苛，不写分号，是不负责任的。
  你可知不写分号，如果遇到两个连续的函数自执行，会导致程序报错。
  不信你看上述案例。
”
S教长老道：“
  分号，可以加，可以不加，必要时不得不加。
  就像你说的那样，两个连续的函数自执行，会导致程序报错。
  但是并不一定非要在行尾附加分号。
  也可以在开头附加分号。
  亦或者使用块级作用域。
  都是可行的。
  不信你看上述案例。
“
A教长老道：”休要继续狡辩，看剑。“

斗宗强者恐怖如斯，两位长老的战斗持续了1个月。

阿坤因失血过多大结局。
*/
